module.exports = {
  //Экспортируем правила форматирования наружу.

  semi: true,
  //Semicolon: Обязательно автоматически дописывать точку с запятой ; в конце каждой законченной строки кода.

  trailingComma: 'es5',
  //Ставить запятую в конце последнего элемента в массивах или объектах, если они записаны в несколько строк.
  //Зачем это QA: Когда ты будешь добавлять новый локатор в список, Git в истории изменений (Commit History) подсветит ровно одну новую добавленную строчку. Если бы этой запятой не было, Git посчитал бы, что ты изменила и предыдущую строку (чтобы дописать туда запятую).

  singleQuote: true,
  //Автоматически принудительно переводить все строки в коде на одинарные кавычки ('#submit-btn') вместо двойных ("#submit-btn").

  printWidth: 100,
  //Максимальное количество символов в одной строке кода. Если строка превысит 100 символов, Prettier красиво и аккуратно перенесет её на след. строчку, чтобы тебе не приходилось скроллить экран вправо.

  tabWidth: 2,
  //Каждый отступ (вложенность внутри test или describe) равен строго двум пробелам.

  useTabs: false,
  //Запрещает использовать скрытый символ табуляции Tab для отступов, заменяя его пробелами. Пробел на любом компьютере и в любом сервисе (GitHub) отображается одинаково, а  Tab может прыгать от 4 - 8 пробелов, из-за чего верстка может «поплыть».
  endOfLine: 'auto',
};
